Rails/RailsII_User/solutions/secrets-new/app/controllers/secrets_controller.rb

SELECT "secrets".* FROM "secrets"
---
  def index
    @secrets = Secret.all