Rails/RailsII_User/solutions/user authentication ii/app/controllers/likes_controller.rb

SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "likes" ("user_id", "secret_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["secret_id", 8], ["created_at", "2015-07-21 04:20:37.973820"], ["updated_at", "2015-07-21 04:20:37.973820"]]
---
  def create
    secret = Secret.find(params['secret_id'])
    like = Like.create(user: current_user, secret: secret)

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 19]]
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT 1  [["id", 19]]
---
  def destroy
    like = Like.find(params[:id]).destroy